Revit 2025 API
DuctShape Enumeration
 Enumerated type listing possible shapes for ducts.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DuctShape
Public Enumeration DuctShape
public enum class DuctShape
type DuctShape
Members
Member name | Value | Description
Round | 0 |  Round duct shape.
Rectangular | 1 |  Rectangular duct shape.
Oval | 2 |  Oval duct shape.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace